artillery-tests/reports/house-caching-20get.txt
--------------------------------
Summary report @ 15:21:20(+0000)
--------------------------------

http.codes.201: ................................................................ 130
http.codes.202: ................................................................ 2600
http.codes.204: ................................................................ 130
http.downloaded_bytes: ......................................................... 574600
http.request_rate: ............................................................. 86/sec
http.requests: ................................................................. 2860
http.response_time:
  min: ......................................................................... 16
  max: ......................................................................... 535
  median: ...................................................................... 66
  p95: ......................................................................... 290.1
  p99: ......................................................................... 478.3
http.responses: ................................................................ 2860
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 130
plugins.metrics-by-endpoint.GET /house/:houseID.codes.202: ..................... 2600
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 130
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 26
  max: ......................................................................... 492
  median: ...................................................................... 74.4
  p95: ......................................................................... 284.3
  p99: ......................................................................... 468.8
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 16
  max: ......................................................................... 535
  median: ...................................................................... 64.7
  p95: ......................................................................... 290.1
  p99: ......................................................................... 478.3
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 49
  max: ......................................................................... 491
  median: ...................................................................... 71.5
  p95: ......................................................................... 290.1
  p99: ......................................................................... 459.5
vusers.completed: .............................................................. 130
vusers.created: ................................................................ 130
vusers.created_by_name.House Flow: ............................................. 130
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2151.5
  max: ......................................................................... 4845.2
  median: ...................................................................... 2671
  p95: ......................................................................... 3534.1
  p99: ......................................................................... 3678.4