artillery-tests/reports/house-caching-30get.txt
http.codes.200: ................................................................ 190
http.codes.201: ................................................................ 190
http.codes.202: ................................................................ 2850
http.codes.204: ................................................................ 95
http.downloaded_bytes: ......................................................... 558600
http.request_rate: ............................................................. 138/sec
http.requests: ................................................................. 3325
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4351
  median: ...................................................................... 77.5
  p95: ......................................................................... 450.4
  p99: ......................................................................... 1686.1
http.responses: ................................................................ 3325
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 95
plugins.metrics-by-endpoint.DELETE /user/:userID.codes.200: .................... 95
plugins.metrics-by-endpoint.GET /house/:houseID.codes.202: ..................... 2850
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 95
plugins.metrics-by-endpoint.POST /user.codes.201: .............................. 95
plugins.metrics-by-endpoint.POST /user/auth.codes.200: ......................... 95
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 51
  max: ......................................................................... 1379
  median: ...................................................................... 127.8
  p95: ......................................................................... 450.4
  p99: ......................................................................... 757.6
plugins.metrics-by-endpoint.response_time.DELETE /user/:userID:
  min: ......................................................................... 76
  max: ......................................................................... 3141
  median: ...................................................................... 190.6
  p95: ......................................................................... 497.8
  p99: ......................................................................... 2893.5
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 0
  max: ......................................................................... 2880
  median: ...................................................................... 68.7
  p95: ......................................................................... 391.6
  p99: ......................................................................... 608
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 53
  max: ......................................................................... 2874
  median: ...................................................................... 130.3
  p95: ......................................................................... 539.2
  p99: ......................................................................... 632.8
plugins.metrics-by-endpoint.response_time.POST /user:
  min: ......................................................................... 59
  max: ......................................................................... 4351
  median: ...................................................................... 278.7
  p95: ......................................................................... 3262.4
  p99: ......................................................................... 4316.6
plugins.metrics-by-endpoint.response_time.POST /user/auth:
  min: ......................................................................... 65
  max: ......................................................................... 1690
  median: ...................................................................... 162.4
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1300.1
vusers.completed: .............................................................. 95
vusers.created: ................................................................ 95
vusers.created_by_name.House Flow: ............................................. 95
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3464
  max: ......................................................................... 10846.1
  median: ...................................................................... 5711.5
  p95: ......................................................................... 10201.2
  p99: ......................................................................... 10617.5