artillery-tests/reports/house-caching-30get.txt
--------------------------------
Summary report @ 15:49:35(+0000)
--------------------------------

http.codes.200: ................................................................ 3040
http.codes.201: ................................................................ 190
http.codes.204: ................................................................ 95
http.downloaded_bytes: ......................................................... 558600
http.request_rate: ............................................................. 98/sec
http.requests: ................................................................. 3325
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4198
  median: ...................................................................... 237.5
  p95: ......................................................................... 804.5
  p99: ......................................................................... 1408.4
http.responses: ................................................................ 3325
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 95
plugins.metrics-by-endpoint.DELETE /user/:userID.codes.200: .................... 95
plugins.metrics-by-endpoint.GET /house/:houseID.codes.200: ..................... 2850
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 95
plugins.metrics-by-endpoint.POST /user.codes.201: .............................. 95
plugins.metrics-by-endpoint.POST /user/auth.codes.200: ......................... 95
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 87
  max: ......................................................................... 1734
  median: ...................................................................... 340.4
  p95: ......................................................................... 742.6
  p99: ......................................................................... 1408.4
plugins.metrics-by-endpoint.response_time.DELETE /user/:userID:
  min: ......................................................................... 102
  max: ......................................................................... 1986
  median: ...................................................................... 399.5
  p95: ......................................................................... 982.6
  p99: ......................................................................... 1556.5
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 0
  max: ......................................................................... 1646
  median: ...................................................................... 190.6
  p95: ......................................................................... 685.5
  p99: ......................................................................... 1300.1
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 91
  max: ......................................................................... 1415
  median: ...................................................................... 441.5
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1380.5
plugins.metrics-by-endpoint.response_time.POST /user:
  min: ......................................................................... 122
  max: ......................................................................... 4198
  median: ...................................................................... 487.9
  p95: ......................................................................... 1790.4
  p99: ......................................................................... 3678.4
plugins.metrics-by-endpoint.response_time.POST /user/auth:
  min: ......................................................................... 126
  max: ......................................................................... 1376
  median: ...................................................................... 468.8
  p95: ......................................................................... 1107.9
  p99: ......................................................................... 1353.1
vusers.completed: .............................................................. 95
vusers.created: ................................................................ 95
vusers.created_by_name.House Flow: ............................................. 95
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 6653.4
  max: ......................................................................... 20115.4
  median: ...................................................................... 11971.2
  p95: ......................................................................... 16159.7
  p99: ......................................................................... 18588.1